; domain
(define (domain n-puzzle-typed)
  (:requirements :typing)
  (:types position tile)
  (:predicates (at ?tile - tile ?position - position)
	       (neighbor ?p1 - position ?p2 - position) 
	       (empty ?position - position)
   )

  (:action move
     :parameters (?tile - tile ?from ?to - position)
     :precondition (and (neighbor ?from ?to)
			(at ?tile ?from)
			(empty ?to))
     :effect (and (at ?tile ?to) (empty ?from) 
		  (not (at ?tile ?from)) (not (empty ?to)))
  )
)

; problem
(define (problem n-puzzle-n4-s1237)
(:domain n-puzzle-typed)
  (:objects p_1_1 p_1_2 p_1_3 p_1_4 p_2_1 p_2_2 p_2_3 p_2_4 p_3_1 p_3_2 p_3_3 p_3_4 p_4_1 p_4_2 p_4_3 p_4_4 - position t_1 t_2 t_3 t_4 t_5 t_6 t_7 t_8 t_9 t_10 t_11 t_12 t_13 t_14 t_15 - tile)
  (:init
    (empty p_1_1)
    (at t_2 p_1_2)
    (at t_7 p_1_3)
    (at t_6 p_1_4)
    (at t_5 p_2_1)
    (at t_10 p_2_2)
    (at t_13 p_2_3)
    (at t_9 p_2_4)
    (at t_12 p_3_1)
    (at t_15 p_3_2)
    (at t_8 p_3_3)
    (at t_4 p_3_4)
    (at t_14 p_4_1)
    (at t_1 p_4_2)
    (at t_11 p_4_3)
    (at t_3 p_4_4)
    (neighbor p_1_1 p_1_2)
    (neighbor p_1_2 p_1_1)
    (neighbor p_1_2 p_1_3)
    (neighbor p_1_3 p_1_2)
    (neighbor p_1_3 p_1_4)
    (neighbor p_1_4 p_1_3)
    (neighbor p_2_1 p_2_2)
    (neighbor p_2_2 p_2_1)
    (neighbor p_2_2 p_2_3)
    (neighbor p_2_3 p_2_2)
    (neighbor p_2_3 p_2_4)
    (neighbor p_2_4 p_2_3)
    (neighbor p_3_1 p_3_2)
    (neighbor p_3_2 p_3_1)
    (neighbor p_3_2 p_3_3)
    (neighbor p_3_3 p_3_2)
    (neighbor p_3_3 p_3_4)
    (neighbor p_3_4 p_3_3)
    (neighbor p_4_1 p_4_2)
    (neighbor p_4_2 p_4_1)
    (neighbor p_4_2 p_4_3)
    (neighbor p_4_3 p_4_2)
    (neighbor p_4_3 p_4_4)
    (neighbor p_4_4 p_4_3)
    (neighbor p_1_1 p_2_1)
    (neighbor p_2_1 p_1_1)
    (neighbor p_1_2 p_2_2)
    (neighbor p_2_2 p_1_2)
    (neighbor p_1_3 p_2_3)
    (neighbor p_2_3 p_1_3)
    (neighbor p_1_4 p_2_4)
    (neighbor p_2_4 p_1_4)
    (neighbor p_2_1 p_3_1)
    (neighbor p_3_1 p_2_1)
    (neighbor p_2_2 p_3_2)
    (neighbor p_3_2 p_2_2)
    (neighbor p_2_3 p_3_3)
    (neighbor p_3_3 p_2_3)
    (neighbor p_2_4 p_3_4)
    (neighbor p_3_4 p_2_4)
    (neighbor p_3_1 p_4_1)
    (neighbor p_4_1 p_3_1)
    (neighbor p_3_2 p_4_2)
    (neighbor p_4_2 p_3_2)
    (neighbor p_3_3 p_4_3)
    (neighbor p_4_3 p_3_3)
    (neighbor p_3_4 p_4_4)
    (neighbor p_4_4 p_3_4))
  (:goal (and
    (at t_1 p_1_1)
    (at t_2 p_1_2)
    (at t_3 p_1_3)
    (at t_4 p_1_4)
    (at t_5 p_2_1)
    (at t_6 p_2_2)
    (at t_7 p_2_3)
    (at t_8 p_2_4)
    (at t_9 p_3_1)
    (at t_10 p_3_2)
    (at t_11 p_3_3)
    (at t_12 p_3_4)
    (at t_13 p_4_1)
    (at t_14 p_4_2)
    (at t_15 p_4_3))))

; plan
1. (move t_5 p_2_1 p_1_1)
   deleted: (at t_5 p_2_1) (empty p_1_1)
   added: (at t_5 p_1_1) (empty p_2_1)
   goals met: 1 of 15
2. (move t_10 p_2_2 p_2_1)
   deleted: (at t_10 p_2_2) (empty p_2_1)
   added: (at t_10 p_2_1) (empty p_2_2)
   goals met: 1 of 15
3. (move t_13 p_2_3 p_2_2)
   deleted: (at t_13 p_2_3) (empty p_2_2)
   added: (at t_13 p_2_2) (empty p_2_3)
   goals met: 1 of 15
4. (move t_9 p_2_4 p_2_3)
   deleted: (at t_9 p_2_4) (empty p_2_3)
   added: (at t_9 p_2_3) (empty p_2_4)
   goals met: 1 of 15
5. (move t_4 p_3_4 p_2_4)
   deleted: (at t_4 p_3_4) (empty p_2_4)
   added: (at t_4 p_2_4) (empty p_3_4)
   goals met: 1 of 15
6. (move t_8 p_3_3 p_3_4)
   deleted: (at t_8 p_3_3) (empty p_3_4)
   added: (at t_8 p_3_4) (empty p_3_3)
   goals met: 1 of 15
7. (move t_15 p_3_2 p_3_3)
   deleted: (at t_15 p_3_2) (empty p_3_3)
   added: (at t_15 p_3_3) (empty p_3_2)
   goals met: 1 of 15
8. (move t_12 p_3_1 p_3_2)
   deleted: (at t_12 p_3_1) (empty p_3_2)
   added: (at t_12 p_3_2) (empty p_3_1)
   goals met: 1 of 15
9. (move t_10 p_2_1 p_3_1)
   deleted: (at t_10 p_2_1) (empty p_3_1)
   added: (at t_10 p_3_1) (empty p_2_1)
   goals met: 1 of 15
10. (move t_13 p_2_2 p_2_1)
   deleted: (at t_13 p_2_2) (empty p_2_1)
   added: (at t_13 p_2_1) (empty p_2_2)
   goals met: 1 of 15
11. (move t_9 p_2_3 p_2_2)
   deleted: (at t_9 p_2_3) (empty p_2_2)
   added: (at t_9 p_2_2) (empty p_2_3)
   goals met: 1 of 15
12. (move t_7 p_1_3 p_2_3)
   deleted: (at t_7 p_1_3) (empty p_2_3)
   added: (at t_7 p_2_3) (empty p_1_3)
   goals met: 2 of 15
13. (move t_6 p_1_4 p_1_3)
   deleted: (at t_6 p_1_4) (empty p_1_3)
   added: (at t_6 p_1_3) (empty p_1_4)
   goals met: 2 of 15
14. (move t_4 p_2_4 p_1_4)
   deleted: (at t_4 p_2_4) (empty p_1_4)
   added: (at t_4 p_1_4) (empty p_2_4)
   goals met: 3 of 15
15. (move t_8 p_3_4 p_2_4)
   deleted: (at t_8 p_3_4) (empty p_2_4)
   added: (at t_8 p_2_4) (empty p_3_4)
   goals met: 4 of 15
16. (move t_15 p_3_3 p_3_4)
   deleted: (at t_15 p_3_3) (empty p_3_4)
   added: (at t_15 p_3_4) (empty p_3_3)
   goals met: 4 of 15
17. (move t_12 p_3_2 p_3_3)
   deleted: (at t_12 p_3_2) (empty p_3_3)
   added: (at t_12 p_3_3) (empty p_3_2)
   goals met: 4 of 15
18. (move t_1 p_4_2 p_3_2)
   deleted: (at t_1 p_4_2) (empty p_3_2)
   added: (at t_1 p_3_2) (empty p_4_2)
   goals met: 4 of 15
19. (move t_11 p_4_3 p_4_2)
   deleted: (at t_11 p_4_3) (empty p_4_2)
   added: (at t_11 p_4_2) (empty p_4_3)
   goals met: 4 of 15
20. (move t_3 p_4_4 p_4_3)
   deleted: (at t_3 p_4_4) (empty p_4_3)
   added: (at t_3 p_4_3) (empty p_4_4)
   goals met: 4 of 15
21. (move t_15 p_3_4 p_4_4)
   deleted: (at t_15 p_3_4) (empty p_4_4)
   added: (at t_15 p_4_4) (empty p_3_4)
   goals met: 4 of 15
22. (move t_12 p_3_3 p_3_4)
   deleted: (at t_12 p_3_3) (empty p_3_4)
   added: (at t_12 p_3_4) (empty p_3_3)
   goals met: 5 of 15
23. (move t_1 p_3_2 p_3_3)
   deleted: (at t_1 p_3_2) (empty p_3_3)
   added: (at t_1 p_3_3) (empty p_3_2)
   goals met: 5 of 15
24. (move t_10 p_3_1 p_3_2)
   deleted: (at t_10 p_3_1) (empty p_3_2)
   added: (at t_10 p_3_2) (empty p_3_1)
   goals met: 6 of 15
25. (move t_13 p_2_1 p_3_1)
   deleted: (at t_13 p_2_1) (empty p_3_1)
   added: (at t_13 p_3_1) (empty p_2_1)
   goals met: 6 of 15
26. (move t_9 p_2_2 p_2_1)
   deleted: (at t_9 p_2_2) (empty p_2_1)
   added: (at t_9 p_2_1) (empty p_2_2)
   goals met: 6 of 15
27. (move t_7 p_2_3 p_2_2)
   deleted: (at t_7 p_2_3) (empty p_2_2)
   added: (at t_7 p_2_2) (empty p_2_3)
   goals met: 5 of 15
28. (move t_1 p_3_3 p_2_3)
   deleted: (at t_1 p_3_3) (empty p_2_3)
   added: (at t_1 p_2_3) (empty p_3_3)
   goals met: 5 of 15
29. (move t_3 p_4_3 p_3_3)
   deleted: (at t_3 p_4_3) (empty p_3_3)
   added: (at t_3 p_3_3) (empty p_4_3)
   goals met: 5 of 15
30. (move t_11 p_4_2 p_4_3)
   deleted: (at t_11 p_4_2) (empty p_4_3)
   added: (at t_11 p_4_3) (empty p_4_2)
   goals met: 5 of 15
31. (move t_14 p_4_1 p_4_2)
   deleted: (at t_14 p_4_1) (empty p_4_2)
   added: (at t_14 p_4_2) (empty p_4_1)
   goals met: 6 of 15
32. (move t_13 p_3_1 p_4_1)
   deleted: (at t_13 p_3_1) (empty p_4_1)
   added: (at t_13 p_4_1) (empty p_3_1)
   goals met: 7 of 15
33. (move t_10 p_3_2 p_3_1)
   deleted: (at t_10 p_3_2) (empty p_3_1)
   added: (at t_10 p_3_1) (empty p_3_2)
   goals met: 6 of 15
34. (move t_7 p_2_2 p_3_2)
   deleted: (at t_7 p_2_2) (empty p_3_2)
   added: (at t_7 p_3_2) (empty p_2_2)
   goals met: 6 of 15
35. (move t_1 p_2_3 p_2_2)
   deleted: (at t_1 p_2_3) (empty p_2_2)
   added: (at t_1 p_2_2) (empty p_2_3)
   goals met: 6 of 15
36. (move t_6 p_1_3 p_2_3)
   deleted: (at t_6 p_1_3) (empty p_2_3)
   added: (at t_6 p_2_3) (empty p_1_3)
   goals met: 6 of 15
37. (move t_2 p_1_2 p_1_3)
   deleted: (at t_2 p_1_2) (empty p_1_3)
   added: (at t_2 p_1_3) (empty p_1_2)
   goals met: 5 of 15
38. (move t_1 p_2_2 p_1_2)
   deleted: (at t_1 p_2_2) (empty p_1_2)
   added: (at t_1 p_1_2) (empty p_2_2)
   goals met: 5 of 15
39. (move t_6 p_2_3 p_2_2)
   deleted: (at t_6 p_2_3) (empty p_2_2)
   added: (at t_6 p_2_2) (empty p_2_3)
   goals met: 6 of 15
40. (move t_3 p_3_3 p_2_3)
   deleted: (at t_3 p_3_3) (empty p_2_3)
   added: (at t_3 p_2_3) (empty p_3_3)
   goals met: 6 of 15
41. (move t_7 p_3_2 p_3_3)
   deleted: (at t_7 p_3_2) (empty p_3_3)
   added: (at t_7 p_3_3) (empty p_3_2)
   goals met: 6 of 15
42. (move t_10 p_3_1 p_3_2)
   deleted: (at t_10 p_3_1) (empty p_3_2)
   added: (at t_10 p_3_2) (empty p_3_1)
   goals met: 7 of 15
43. (move t_9 p_2_1 p_3_1)
   deleted: (at t_9 p_2_1) (empty p_3_1)
   added: (at t_9 p_3_1) (empty p_2_1)
   goals met: 8 of 15
44. (move t_5 p_1_1 p_2_1)
   deleted: (at t_5 p_1_1) (empty p_2_1)
   added: (at t_5 p_2_1) (empty p_1_1)
   goals met: 9 of 15
45. (move t_1 p_1_2 p_1_1)
   deleted: (at t_1 p_1_2) (empty p_1_1)
   added: (at t_1 p_1_1) (empty p_1_2)
   goals met: 10 of 15
46. (move t_2 p_1_3 p_1_2)
   deleted: (at t_2 p_1_3) (empty p_1_2)
   added: (at t_2 p_1_2) (empty p_1_3)
   goals met: 11 of 15
47. (move t_3 p_2_3 p_1_3)
   deleted: (at t_3 p_2_3) (empty p_1_3)
   added: (at t_3 p_1_3) (empty p_2_3)
   goals met: 12 of 15
48. (move t_7 p_3_3 p_2_3)
   deleted: (at t_7 p_3_3) (empty p_2_3)
   added: (at t_7 p_2_3) (empty p_3_3)
   goals met: 13 of 15
49. (move t_11 p_4_3 p_3_3)
   deleted: (at t_11 p_4_3) (empty p_3_3)
   added: (at t_11 p_3_3) (empty p_4_3)
   goals met: 14 of 15
50. (move t_15 p_4_4 p_4_3)
   deleted: (at t_15 p_4_4) (empty p_4_3)
   added: (at t_15 p_4_3) (empty p_4_4)
   goals met: 15 of 15
